posts/reading/introducing-go/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Introducing Go | Warren Liu</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reading/introducing-go/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../gradle-in-action/" title="Gradle In Action" type="text/html">
<link rel="next" href="../go-in-action/" title="Go In Action" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Introducing Go">
<meta property="og:url" content="https://example.com/posts/reading/introducing-go/">
<meta property="og:description" content="Table of Contents


Chapter 1. Getting started
Chapter 2. Types
Chapter 3. Variables
Chapter 4. Control Structures
Chapter 5. Arrays, Slices, and Maps
Chapter 6: Functions
Chapter 7: Structs and Inter">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="go">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Introducing Go</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Chapter 1. Getting started</a></li>
<li><a href="#sec-2">Chapter 2. Types</a></li>
<li><a href="#sec-3">Chapter 3. Variables</a></li>
<li><a href="#sec-4">Chapter 4. Control Structures</a></li>
<li><a href="#sec-5">Chapter 5. Arrays, Slices, and Maps</a></li>
<li><a href="#sec-6">Chapter 6: Functions</a></li>
<li><a href="#sec-7">Chapter 7: Structs and Interfaces</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Chapter 1. Getting started</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The Go toolset uses an environment variable called <code>GOPATH</code> to find
Go source code.
</li>
<li>Find document for certain function using <code>godoc</code>:
<div class="highlight"><pre><span></span>godoc fmt Println
</pre></div>
</li>
</ul>
<p>
w  will get document for function <code>Println</code> in package <code>fmt</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Chapter 2. Types</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Go is a statically typed language. Variables have specific types and
type cannot change.
</li>
<li>Number Types
<ul class="org-ul">
<li>Go’s integer types are <code>uint8</code>, <code>uint16</code>, <code>uint32</code>, <code>uint64</code>,
<code>int8</code>, <code>int16</code>, <code>int32</code>, and <code>int64</code>.
</li>
<li>There are also three machine dependent integer types: <code>uint</code>, <code>int</code>,
and <code>uintptr</code>. They are machine dependent because their size depends
on the type of architecture you are using.
</li>
<li>Go has two floating-point types: <code>float32</code> and <code>float64</code> (also often
referred to as single precision and double precision,
respectively).
</li>
<li>For complex numbers, it has: <code>complex64</code> and <code>complex128</code>.
</li>
</ul>
</li>
<li>String
<ul class="org-ul">
<li>String literals can double quotes "Hello, World" or backticks
`Hello, World`. Double-quoted strings <b>cannot</b> contain newlines and
they allow special escape sequences.
</li>
<li>Common String operations:
<ul class="org-ul">
<li>Length: <code>len("Hello World")</code>
</li>
<li>Index: ~"Hello World"[​1]~
</li>
<li>Concat: ~"Hello " + "World"~
</li>
</ul>
</li>
</ul>
</li>
<li>Boolean type
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Chapter 3. Variables</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>constant: ~const x string = "Hello, World"~
</li>
<li>Define multiple variables:
<div class="highlight"><pre><span></span>var (
  a = 5
  b = 10
  c = 11
)
</pre></div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Chapter 4. Control Structures</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>for loop:
<div class="highlight"><pre><span></span>i = 0
for i&lt;=10 {}
</pre></div>

<div class="highlight"><pre><span></span>for i=0;i&lt;=10;i++ {}
</pre></div>
</li>
<li>switch:
<div class="highlight"><pre><span></span>switch i {
    case 0: ...
    case 1: ...
    default: ...
}
</pre></div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Chapter 5. Arrays, Slices, and Maps</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Define and using array:
<div class="highlight"><pre><span></span>func main() {
	var x [5]int
	x[40]=10
	var total int = 0;
	for i=0; i&lt;5; i++{
		total+=x[i]
	}
	fmt.Println(total / len(x))
}
</pre></div>
</li>
<li>A special form of for loop allow:
<div class="highlight"><pre><span></span>for _, value:=range x {
	total +=value
}
</pre></div>
<p>
A single underscore (_) is used to tell the compiler it(the iterator variable)
is not needed in the loop
</p>
</li>
<li>Shortcut to define array:
<div class="highlight"><pre><span></span>x:=[3]float64{98, 99, 199}
</pre></div>
<p>
or in multiple lines:
</p>
<div class="highlight"><pre><span></span>x := [4]float64 {
	98,
	99,
	100,
	102,
}
</pre></div>
<p>
Note that the extra trailing ',' in the last line is required by Go.
</p>
</li>
<li>Array in Go is fix length, and is actually in the type declaration. Usually
slice is used, which is a type built on top of an array.
</li>
<li>A slice is a segment of an array. Its length is allowed to change.
<div class="highlight"><pre><span></span>var x []float64
</pre></div>
</li>
<li>To create a slice, using the <code>make</code> function:
<div class="highlight"><pre><span></span>x := make([]float64, 5)
</pre></div>
<p>
This creates a slice that is associated with an underlying float64 array of
length 5. Slices are always associated with some array, they can be smaller
but not longer than the associated array.
</p>
</li>
<li>Slice can also be created using <code>[low : high]</code> expression:
<div class="highlight"><pre><span></span>arr := [5]float64 {1,2,3,4,5}
x := arr[0:5]
</pre></div>
<p>
In this expression, both 'low' and 'high' can be omitted.
</p>
</li>
<li>Map
<div class="highlight"><pre><span></span>var x map[string]int
x := make(map[string]int)

x["key"] = 10
fmt.Println(x)
</pre></div>
<ul class="org-ul">
<li>length of map can change as adding new item to it.
</li>
<li>maps are not sequential.
</li>
<li>can be deleted with <code>delete</code> function: <code>delete(x,1)</code>
</li>
<li>a map returns the zero value for the value type when the key doesn't exist.
</li>
<li>It can also return two values like:
<div class="highlight"><pre><span></span>name, ok := elements["Un"]
</pre></div>
<p>
in which, the <code>name</code> is the value returned, and <code>ok</code> tells whether the
lookup is successful.
</p>
</li>
<li>A common pattern in go looks like:
<div class="highlight"><pre><span></span>if name, ok := elements["Un"]; ok{
	fmt.Println(name, ok)
}
</pre></div>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Chapter 6: Functions</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Function's return type can be named:
<div class="highlight"><pre><span></span>func f2() (r int){
	r=1
	return
}
</pre></div>
</li>
<li>Function can return multiple value:
<div class="highlight"><pre><span></span>func f() (int, int) {
	return 5, 6
}
func main() {
	x,y:=f()
}
</pre></div>
<p>
Multiple values are often used to return an error value along with the
result <code>(x, err := f())</code>, or a boolean to indicate success <code>(x, ok := f())</code>.
</p>
</li>
<li>Variadic Functions:
<div class="highlight"><pre><span></span>func add(args ...int) int {
	total := 0
	for _, v := range args {
		total += v
	}
	return total
}
</pre></div>
<p>
in this example <code>add</code> is allowed to be called with multiple
integers, this parameter is known as a <b>variadic</b> parameter.
</p>
</li>
<li>It is possible to create functions inside function, which creates
<b>Closure</b>:
<div class="highlight"><pre><span></span>func main() {
	add := func(x, y int) int {
		  return x+y
		}
	fmt.Println(add(1,1))
}
</pre></div>
<p>
When you create a local function like this, it also has access to
other local variables.
</p>
</li>
<li>
<code>defer</code>: a special statement that schedules a function call to be run
after the function completes. It basically moves the call to the end
of the function. It is often used when some resource need to be
cleaned in some way:
<div class="highlight"><pre><span></span>f, _ := os.Open(filename)
defer f.Close()
</pre></div>
<ul class="org-ul">
<li>It keeps the Close() call to Open() so it is easier to understand.
</li>
<li>If there are multiple return statement, the Close() will happen
before both of them.
</li>
<li>Deferred function will run even if a run-time panic occurs.
</li>
</ul>
</li>
<li>
<code>panic</code> function is used to create a run-time error; we can handle a
run-time panic with the build-in <code>recover</code> function.
</li>
<li>recover stops the panic and returns the value that was passed to the
call to panic.
</li>
<li>Here is the example to use <code>recover</code> when having <code>panic</code>:
<div class="highlight"><pre><span></span>func main() {
	defer func() {
		str := recover()
		fmt.Println(str)
	}()
	panic("PANIC")
}
</pre></div>
</li>
<li>
<code>new</code> takes a type as an argument, allocates enough memory to fit a
value of that type, and returns a pointer to it. Go is
garbage-collected so no need to <code>free</code> explicitly.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Chapter 7: Structs and Interfaces</h2>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/go/" rel="tag">go</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../gradle-in-action/" rel="prev" title="Gradle In Action">Previous post</a>
            </li>
            <li class="next">
                <a href="../go-in-action/" rel="next" title="Go In Action">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
